Repository: abolfazlSadeqi/NoSqlCommandGenerateStandarad
Catalog: UI/Resources/Views/Shared/_Layout.*.resx
Languages: fa

# AppName
source: NoSQL Script
fa: ساخت اسکریپت NoSQL

source: MongoDB
fa: مونگو‌دی‌بی

source: Database Management
fa: مدیریت دیتابیس

source: Create Database
fa: ایجاد دیتابیس

source: Drop Database
fa: حذف دیتابیس

source: List Databases
fa: لیست دیتابیس‌ها

source: Use Database
fa: انتخاب دیتابیس (use)

source: Collection Management
fa: مدیریت کالکشن

source: Create Collection
fa: ایجاد کالکشن

source: Drop Collection
fa: حذف کالکشن

source: List Collections
fa: نمایش کالکشن‌ها

source: Rename Collection
fa: تغییر نام کالکشن

source: Index Management
fa: مدیریت ایندکس

source: Create Index
fa: ایجاد ایندکس

source: Drop Index
fa: حذف ایندکس

source: List Indexes
fa: نمایش ایندکس‌ها

source: Advanced Index Builder
fa: سازنده پیشرفته ایندکس

source: Document Operations
fa: عملیات سند

source: Insert Document
fa: درج سند

source: Update Document
fa: به‌روز رسانی سند

source: Delete Document
fa: حذف سند

source: Query _ Bulk
fa: کوئری و عملیات گروهی

source: Query Builder
fa: سازنده کوئری

source: Bulk Operations
fa: عملیات گروهی

source: Views
fa: ویو‌ها

source: Manage Views
fa: مدیریت ویو

source: Info _ Security
fa: اطلاعات و امنیت

source: General Commands
fa: دستورات عمومی

source: Security / Users _ Roles
fa: امنیت / کاربران و نقش‌ها

source: Redis
fa: ردیس

source: Database
fa: دیتابیس

source: Manage Database
fa: مدیریت دیتابیس

source: Clear / Flush
fa: پاکسازی / فلَش

source: Clear Database
fa: پاکسازی دیتابیس

source: Clear All Databases
fa: پاکسازی همه دیتابیس‌ها

source: Clear By Pattern
fa: پاکسازی بر اساس الگو

source: Clear Expired Keys
fa: پاکسازی کلیدهای منقضی

source: Key Operations
fa: عملیات کلید

source: Add Key
fa: افزودن کلید

source: Update Key
fa: به‌روز رسانی کلید

source: Delete Key
fa: حذف کلید

# Set TTL
source: Set / Remove TTL
fa: تنظیم TTL

source: Rename Key
fa: تغییر نام کلید

source: Persist Key
fa: حذف TTL (Persist)

source: Copy Key
fa: کپی کلید

source: Move Key
fa: جابجایی کلید

# Generic Key Ops
source: Generic Key Operations
fa: عملیات عمومی کلید

source: Key Inspector
fa: بازرس کلید

source: Lists
fa: لیست‌ها

source: List Operations
fa: عملیات لیست

source: Sets _ Sorted Sets
fa: ست‌ها و زِت‌ها

source: Hash Operations
fa: عملیات هش

source: Counters
fa: کانترها

source: Search / Scan
fa: جستجو / اسکن

source: Server Info
fa: اطلاعات سرور

source: Security
fa: امنیت

# Require Pass
source: Set requirepass
fa: تنظیم requirepass

source: ACL SETUSER
fa: ایجاد/تنظیم کاربر (ACL SETUSER)

source: ACL DELUSER
fa: حذف کاربر (ACL DELUSER)

source: ACL LIST
fa: لیست ACL

source: Reset Password
fa: تنظیم مجدد رمز
